In [1]:
%matplotlib qt
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# aspect_ratio=(12,8) # good for inline
aspect_ratio=(8,5) # good for qt

In [3]:
# Load up AAPL price data
dfAAPL = pd.read_csv('AAPL.csv', index_col=0, parse_dates=True)

#### in HW 1, you wrote a function to read in and do a bunch of visual checks

In [4]:
# perform those visual checks
dfAAPL

                 Open       High        Low      Close  Adj Close     Volume
Date
2014-12-31  28.205000  28.282499  27.552500  27.594999  24.733967  165613600
2015-01-02  27.847500  27.860001  26.837500  27.332500  24.498682  212818400
2015-01-05  27.072500  27.162500  26.352501  26.562500  23.808519  257142000
2015-01-06  26.635000  26.857500  26.157499  26.565001  23.810757  263188400
2015-01-07  26.799999  27.049999  26.674999  26.937500  24.144629  160423600
...               ...        ...        ...        ...        ...        ...
2019-12-24  71.172501  71.222504  70.730003  71.067497  69.327438   48478800
2019-12-26  71.205002  72.495003  71.175003  72.477501  70.702934   93121200
2019-12-27  72.779999  73.492500  72.029999  72.449997  70.676109  146266000
2019-12-30  72.364998  73.172501  71.305000  72.879997  71.095566  144114400
2019-12-31  72.482498  73.419998  72.379997  73.412498  71.615044  100805600

[1259 rows x 6 columns]

In [5]:
dfAAPL.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2014-12-31 to 2019-12-31
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       1259 non-null   float64
 1   High       1259 non-null   float64
 2   Low        1259 non-null   float64
 3   Close      1259 non-null   float64
 4   Adj Close  1259 non-null   float64
 5   Volume     1259 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 68.9 KB

In [6]:
dfAAPL.isnull().sum()

Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [7]:
dfAAPL.describe().round(2)

          Open     High      Low    Close  Adj Close        Volume
count  1259.00  1259.00  1259.00  1259.00    1259.00  1.259000e+03
mean     38.59    38.93    38.26    38.61      36.44  1.436171e+08
std      11.00    11.10    10.93    11.03      11.23  7.151227e+07
min      22.50    22.92    22.37    22.58      20.83  4.544800e+07
25%      28.95    29.13    28.62    28.86      26.41  9.512620e+07
50%      37.57    37.96    37.29    37.64      35.54  1.263232e+08
75%      46.48    46.84    46.16    46.49      44.49  1.713764e+08
max      72.78    73.49    72.38    73.41      71.62  6.488252e+08

In [8]:
# We only want the adjusted close price column. (Use double square brackets to return a DataFrame.)
dfAAPL = dfAAPL[['Adj Close']]

In [9]:
# Renaming the Close column to AAPL in preparation for more securities later
dfAAPL.columns=['AAPL']

In [10]:
# Verify
dfAAPL

                 AAPL
Date
2014-12-31  24.733967
2015-01-02  24.498682
2015-01-05  23.808519
2015-01-06  23.810757
2015-01-07  24.144629
...               ...
2019-12-24  69.327438
2019-12-26  70.702934
2019-12-27  70.676109
2019-12-30  71.095566
2019-12-31  71.615044

[1259 rows x 1 columns]

In [11]:
# next, load AMZN and perform the visual checks
dfAMZN = pd.read_csv('AMZN.csv', index_col=0, parse_dates=True)

In [12]:
# repeat all the operations we did with AAPL
dfAMZN = dfAMZN[['Adj Close']]

In [13]:
dfAMZN.columns=['AMZN']

In [14]:
# verify
dfAMZN

                 AMZN
Date
2014-12-31  15.517500
2015-01-02  15.426000
2015-01-05  15.109500
2015-01-06  14.764500
2015-01-07  14.921000
...               ...
2019-12-24  89.460503
2019-12-26  93.438499
2019-12-27  93.489998
2019-12-30  92.344498
2019-12-31  92.391998

[1259 rows x 1 columns]

In [15]:
# next, we will do an "inner" join of AMZN and AAPL
# an "inner" join takes an intersection of the dates, 
# i.e., it preserves only those rows whose index exists in both df's
allPrices = dfAAPL.join([dfAMZN], how ='inner')

In [16]:
allPrices

                 AAPL       AMZN
Date
2014-12-31  24.733967  15.517500
2015-01-02  24.498682  15.426000
2015-01-05  23.808519  15.109500
2015-01-06  23.810757  14.764500
2015-01-07  24.144629  14.921000
...               ...        ...
2019-12-24  69.327438  89.460503
2019-12-26  70.702934  93.438499
2019-12-27  70.676109  93.489998
2019-12-30  71.095566  92.344498
2019-12-31  71.615044  92.391998

[1259 rows x 2 columns]

In [17]:
# now we can look at the summary statistics of ALL the prices series to put everything in context
allPrices.describe()

              AAPL         AMZN
count  1259.000000  1259.000000
mean     36.438027    55.720409
std      11.229058    26.610040
min      20.826065    14.347500
25%      26.413858    33.232498
50%      35.542973    48.389999
75%      44.491113    83.807747
max      71.615044   101.975502

In [18]:
# plot the prices and format the Y-axis as $-amounts
allPrices.plot(figsize=aspect_ratio, title='Simple Price Chart', ylabel='Price', grid=True)

#### In HW 1 you wrote a function to plot and format the Y-axis nicely

In [19]:
# next, we normalize the prices. the initial_investment variable is just a convenient constant in case we want to
# normalize it to a starting value other than $1. In that case, we just have to set a different value for this variable
# the normalized prices times the initial investment now yields an actual $-value of holding the securities, also called
# an NAV (net asset value)
initial_investment = 1
(initial_investment * allPrices / allPrices.iloc[0]).plot(figsize=aspect_ratio, title='Normalized Portfolio NAVs', ylabel='NAV', grid=True)

In [20]:
# calculate Simple Returns using the pct_change method
simpleReturns = allPrices.pct_change()

In [21]:
# the first row will be NaN. That's fine. All our subsequent calculations on returns will skipNA's by default
simpleReturns

                AAPL      AMZN
Date
2014-12-31       NaN       NaN
2015-01-02 -0.009513 -0.005897
2015-01-05 -0.028171 -0.020517
2015-01-06  0.000094 -0.022833
2015-01-07  0.014022  0.010600
...              ...       ...
2019-12-24  0.000951 -0.002114
2019-12-26  0.019841  0.044467
2019-12-27 -0.000379  0.000551
2019-12-30  0.005935 -0.012253
2019-12-31  0.007307  0.000514

[1259 rows x 2 columns]

#### in HW 2, you'll write a function to "pretty-print" percetage numbers, i.e., multiply by 100 and add the "%" sign

In [22]:
# calculate the column-wise mean return
simpleReturns.mean()

AAPL    0.000968
AMZN    0.001587
dtype: float64

In [59]:
# plot the returns time series
simpleReturns.plot(figsize=aspect_ratio, title='Daily Simple Returns', ylabel='Return', grid=True)

In [24]:
# next, do a simple (arithmetic) CUMULATION
# this is NOT the correct method to cumulate simple returns. But we just want to take a look
simpleReturns.cumsum()

                AAPL      AMZN
Date
2014-12-31       NaN       NaN
2015-01-02 -0.009513 -0.005897
2015-01-05 -0.037684 -0.026414
2015-01-06 -0.037590 -0.049247
2015-01-07 -0.023568 -0.038647
...              ...       ...
2019-12-24  1.185014  1.962702
2019-12-26  1.204855  2.007169
2019-12-27  1.204476  2.007720
2019-12-30  1.210410  1.995467
2019-12-31  1.217717  1.995982

[1259 rows x 2 columns]

In [25]:
# for any CUM returns (also called NAV's or equity lines), we have to deal with the first row being NaN
# we will zero them out (the starting value is legitimately zero)
# But first, verify that's the onlyl NaN row
simpleReturns.cumsum().isnull().sum()

AAPL    1
AMZN    1
dtype: int64

In [26]:
simpleReturns[simpleReturns['AAPL'].isnull()]

            AAPL  AMZN
Date
2014-12-31   NaN   NaN

In [27]:
simpleReturns[simpleReturns['AMZN'].isnull()]

            AAPL  AMZN
Date
2014-12-31   NaN   NaN

In [28]:
simpleReturns[simpleReturns['AMZN'].isnull() & simpleReturns['AMZN'].isnull()]

            AAPL  AMZN
Date
2014-12-31   NaN   NaN

In [29]:
# now replace the NaN's with zero and examine again
simpleReturns.cumsum().fillna(0)

                AAPL      AMZN
Date
2014-12-31  0.000000  0.000000
2015-01-02 -0.009513 -0.005897
2015-01-05 -0.037684 -0.026414
2015-01-06 -0.037590 -0.049247
2015-01-07 -0.023568 -0.038647
...              ...       ...
2019-12-24  1.185014  1.962702
2019-12-26  1.204855  2.007169
2019-12-27  1.204476  2.007720
2019-12-30  1.210410  1.995467
2019-12-31  1.217717  1.995982

[1259 rows x 2 columns]

In [30]:
# plot the (incorrectly cumulated) simple returns
simpleReturns.cumsum().fillna(0).plot(figsize=aspect_ratio, title='Simple (incorrect) Sum of Simple Returns', ylabel='NAV, %', grid=True)

In [31]:
# now let's cumulate the returns correctly, i.e., by cumulating (1+R) ("geometric")
(simpleReturns + 1).cumprod()

                AAPL      AMZN
Date
2014-12-31       NaN       NaN
2015-01-02  0.990487  0.994103
2015-01-05  0.962584  0.973707
2015-01-06  0.962674  0.951474
2015-01-07  0.976173  0.961560
...              ...       ...
2019-12-24  2.802924  5.765136
2019-12-26  2.858536  6.021492
2019-12-27  2.857451  6.024811
2019-12-30  2.874410  5.950991
2019-12-31  2.895413  5.954052

[1259 rows x 2 columns]

In [32]:
# once again, we need to deal with the first NaN
# for starters, verify that's the only NaN row
(simpleReturns + 1).cumprod().isnull().sum()

AAPL    1
AMZN    1
dtype: int64

In [33]:
# fill the first NA row with 1 this time because we're cumulating (1+return)
# and pretty-print it as percentages
(simpleReturns + 1).cumprod().fillna(1)

                AAPL      AMZN
Date
2014-12-31  1.000000  1.000000
2015-01-02  0.990487  0.994103
2015-01-05  0.962584  0.973707
2015-01-06  0.962674  0.951474
2015-01-07  0.976173  0.961560
...              ...       ...
2019-12-24  2.802924  5.765136
2019-12-26  2.858536  6.021492
2019-12-27  2.857451  6.024811
2019-12-30  2.874410  5.950991
2019-12-31  2.895413  5.954052

[1259 rows x 2 columns]

In [34]:
# plot this cum. it should look EXACTLY like the original NORMALIZED prices
(simpleReturns + 1).cumprod().fillna(1).plot(figsize=aspect_ratio, title='Cumulative Product of (1+Simple Returns)', ylabel='NAV, %', grid=True)

In [35]:
# let's see if we can get back the final prices by multiplying the last value of 
# the cumulated simple returns by the initial price
# first, let's look at the last row of the cumulated simple returns
(simpleReturns + 1).cumprod().fillna(1).tail(1)

                AAPL      AMZN
Date
2019-12-31  2.895413  5.954052

In [36]:
# actually, if you're just looking at the last row (or any row EXCEPT the first row), then there's no need to fillna(1)
(simpleReturns + 1).cumprod().tail(1)

                AAPL      AMZN
Date
2019-12-31  2.895413  5.954052

In [37]:
# recall the initial price
allPrices.iloc[0]

AAPL    24.733967
AMZN    15.517500
Name: 2014-12-31 00:00:00, dtype: float64

In [38]:
# now multiply this initial price with the last row of the cumprod'd series, you should get back the last row of the original price
allPrices.iloc[0] * (simpleReturns + 1).cumprod().tail(1)

                 AAPL       AMZN
Date
2019-12-31  71.615044  92.391998

In [39]:
# in fact, you can multiply EVERY row of the cumprod((simpleReturns+1)) matrix by the first row of prices
# and expect to get every day's price back (this time, it's necessary to fillna(1) in order to get the first row of original prices)
allPrices.iloc[0] * (simpleReturns + 1).cumprod().fillna(1)

                 AAPL       AMZN
Date
2014-12-31  24.733967  15.517500
2015-01-02  24.498682  15.426000
2015-01-05  23.808519  15.109500
2015-01-06  23.810757  14.764500
2015-01-07  24.144629  14.921000
...               ...        ...
2019-12-24  69.327438  89.460503
2019-12-26  70.702934  93.438499
2019-12-27  70.676109  93.489998
2019-12-30  71.095566  92.344498
2019-12-31  71.615044  92.391998

[1259 rows x 2 columns]

In [40]:
# let's plot this and compare it to the original prices
(allPrices.iloc[0] * (simpleReturns + 1).cumprod().fillna(1)).plot(figsize=aspect_ratio, title='Cumprod of (Returns + 1) * Initial Price', ylabel='Price', grid=True)

In [41]:
# next, we calculate the log returns. First, we verify what the .shift method does
allPrices

                 AAPL       AMZN
Date
2014-12-31  24.733967  15.517500
2015-01-02  24.498682  15.426000
2015-01-05  23.808519  15.109500
2015-01-06  23.810757  14.764500
2015-01-07  24.144629  14.921000
...               ...        ...
2019-12-24  69.327438  89.460503
2019-12-26  70.702934  93.438499
2019-12-27  70.676109  93.489998
2019-12-30  71.095566  92.344498
2019-12-31  71.615044  92.391998

[1259 rows x 2 columns]

In [42]:
# shift(1) "lags" every row by one day, i.e., today gets yesterday's value
allPrices.shift(1)

                 AAPL       AMZN
Date
2014-12-31        NaN        NaN
2015-01-02  24.733967  15.517500
2015-01-05  24.498682  15.426000
2015-01-06  23.808519  15.109500
2015-01-07  23.810757  14.764500
...               ...        ...
2019-12-24  69.261604  89.650002
2019-12-26  69.327438  89.460503
2019-12-27  70.702934  93.438499
2019-12-30  70.676109  93.489998
2019-12-31  71.095566  92.344498

[1259 rows x 2 columns]

In [43]:
# then, it's easy to calculate ln(P[t]/P[t-1])
logReturns = np.log(allPrices / allPrices.shift(1))

In [60]:
logReturns.plot(figsize=aspect_ratio, title='Log returns', ylabel='returns', grid=True)

In [45]:
# log returns can be cumulated by simple addition
logReturns.cumsum()

                AAPL      AMZN
Date
2014-12-31       NaN       NaN
2015-01-02 -0.009558 -0.005914
2015-01-05 -0.038134 -0.026645
2015-01-06 -0.038040 -0.049743
2015-01-07 -0.024116 -0.039199
...              ...       ...
2019-12-24  1.030663  1.751829
2019-12-26  1.050310  1.795335
2019-12-27  1.049930  1.795886
2019-12-30  1.055847  1.783558
2019-12-31  1.063128  1.784072

[1259 rows x 2 columns]

In [46]:
# once again, we need to deal with the first-row NaN before we embark on cumulation
# first, ensure only 2 NULL's
logReturns.cumsum().isnull().sum()

AAPL    1
AMZN    1
dtype: int64

In [47]:
# now we can fillna the first row with ZERO (because we don't cumprod log returns - we simply sum them)
logReturns.cumsum().fillna(0)

                AAPL      AMZN
Date
2014-12-31  0.000000  0.000000
2015-01-02 -0.009558 -0.005914
2015-01-05 -0.038134 -0.026645
2015-01-06 -0.038040 -0.049743
2015-01-07 -0.024116 -0.039199
...              ...       ...
2019-12-24  1.030663  1.751829
2019-12-26  1.050310  1.795335
2019-12-27  1.049930  1.795886
2019-12-30  1.055847  1.783558
2019-12-31  1.063128  1.784072

[1259 rows x 2 columns]

In [48]:
# we can now take the exponent of every element to get back the correctly cumulated simple returns 
# (this should be EXACTLY the same as the cumProd of the simple returns)
logReturns.cumsum().fillna(0).apply(np.exp)

                AAPL      AMZN
Date
2014-12-31  1.000000  1.000000
2015-01-02  0.990487  0.994103
2015-01-05  0.962584  0.973707
2015-01-06  0.962674  0.951474
2015-01-07  0.976173  0.961560
...              ...       ...
2019-12-24  2.802924  5.765136
2019-12-26  2.858536  6.021492
2019-12-27  2.857451  6.024811
2019-12-30  2.874410  5.950991
2019-12-31  2.895413  5.954052

[1259 rows x 2 columns]

In [61]:
# plot it. It should be IDENTICAL to the plot of the cumProd of the simple returns
logReturns.cumsum().fillna(0).apply(np.exp).plot(figsize=aspect_ratio, title='Exponent of Simple Sum of Log Returns', ylabel='NAV, %', grid=True)

In [50]:
# once again, we can multiply every row of this matrix by the first row of prices to get back the price history
allPrices.iloc[0] * logReturns.cumsum().fillna(0).apply(np.exp)

                 AAPL       AMZN
Date
2014-12-31  24.733967  15.517500
2015-01-02  24.498682  15.426000
2015-01-05  23.808519  15.109500
2015-01-06  23.810757  14.764500
2015-01-07  24.144629  14.921000
...               ...        ...
2019-12-24  69.327438  89.460503
2019-12-26  70.702934  93.438499
2019-12-27  70.676109  93.489998
2019-12-30  71.095566  92.344498
2019-12-31  71.615044  92.391998

[1259 rows x 2 columns]

In [51]:
# let's plot this series to verify that it gives us back the original prices
(allPrices.iloc[0] * logReturns.cumsum().fillna(0).apply(np.exp)).plot(figsize=aspect_ratio, title='Exponent of Simple Sum of Log Returns times the First Price', ylabel='Price', grid=True)

In [52]:
# next, we can scatter plot the log returns vs the arithmetic returns to see how good the logarithmic apprxomation is
fig, ax = plt.subplots(figsize=aspect_ratio)
ax.scatter(simpleReturns['AAPL'], logReturns['AAPL'], marker='o', label='log vs simple returns scatter points')
#ax.yaxis.set_major_formatter(mtick.PercentFormatter(xmax=1.0, decimals=0))
#ax.xaxis.set_major_formatter(mtick.PercentFormatter(xmax=1.0, decimals=0))
plt.xlabel('AAPL Airthmetic Returns')
plt.ylabel('AAPL Logarithmic Returns')
plt.title('AAPL Arithmetic (x-axis) vs. Logarithmic (y-axis) Returns')
plt.grid(True)
ax.axline((0, 0), slope=1, linestyle='--', c='r', label='y = x')
plt.legend()

In [53]:
fig, ax = plt.subplots(figsize=aspect_ratio)
ax.scatter(simpleReturns['AMZN'], logReturns['AMZN'], label='log vs. simple returns scatter points')
plt.xlabel('AMZN Airthmetic Returns')
plt.ylabel('AMZN Logarithmic Returns')
plt.title('AMZN Arithmetic (x-axis) vs. Logarithmic (y-axis) Returns')
plt.grid(True)
ax.axline((0, 0), slope=1, linestyle='--', c='r', label='y = x line')
plt.legend()

In [54]:
simpleReturns['AMZN'] < logReturns['AMZN']

Date
2014-12-31    False
2015-01-02    False
2015-01-05    False
2015-01-06    False
2015-01-07    False
              ...
2019-12-24    False
2019-12-26    False
2019-12-27    False
2019-12-30    False
2019-12-31    False
Name: AMZN, Length: 1259, dtype: bool

In [55]:
sum(simpleReturns['AMZN'] < logReturns['AMZN'])

0

In [56]:
simpleReturns[simpleReturns['AMZN'] < logReturns['AMZN']]

Empty DataFrame
Columns: [AAPL, AMZN]
Index: []

In [57]:
sum(simpleReturns['AMZN'] == logReturns['AMZN'])

1

In [58]:
simpleReturns[simpleReturns['AMZN'] == logReturns['AMZN']]

                AAPL  AMZN
Date
2018-11-02 -0.066331   0.0